package reversi;

public interface DisplayBoard {
	// 盤の状態（マスの描画に使用）
	char[] squareStatus = { '　', '●', '○' };
	// マスの状態を表す
	int BLACK = 1, WHITE = BLACK * -1, SPACE = 0, WALL = 9;
	// マスの評価値（COMレベル2が使用）
	int[][] VALUE = {
			{ 45, -11, 4, -1, -1, 4, -11, 45 },
			{ -11, -16, 1, -3, -3, -1, -16, -11 },
			{ 4, -1, 2, -1, -1, 2, -1, 4 },
			{ -1, -3, -1, 0, 0, -1, -3, -1 },
			{ -1, -3, -1, 0, 0, -1, -3, -1 },
			{ 4, -1, 2, -1, -1, 2, -1, 4 },
			{ -11, -16, 1, -3, -3, -1, -16, -11 },
			{ 45, -11, 4, -1, -1, 4, -11, 45 }
	};

	/**
	 * 現在の盤の状態を描画する
	 */
	void drawBoard();
}
